---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinition.GetApplicableResolutionTypes
source: html/243085dd-ebe4-de3f-1da4-5be98981be05.htm
---
# Autodesk.Revit.DB.FailureDefinition.GetApplicableResolutionTypes Method

Retrieves a list of resolution types applicable to the failure.

## Syntax (C#)
```csharp
public IList<FailureResolutionType> GetApplicableResolutionTypes()
```

## Returns
The list of resolution types applicable to the failure.